Analise de Dados com Pandas

In [1]:
import pandas as pd

In [2]:
dataset = pd.read_csv("dados/db.csv", sep=';', index_col = 0)

In [3]:
dataset.head()

,Motor,Ano,Quilometragem,Zero_km,Acessórios,Valor
Nome,,,,,,
Jetta Variant,Motor 4.0 Turbo,2003,44410.0,False,"['Rodas de liga', 'Travas elétricas', 'Piloto ...",88078.64
Passat,Motor Diesel,1991,5712.0,False,"['Central multimídia', 'Teto panorâmico', 'Fre...",106161.94
Crossfox,Motor Diesel V8,1990,37123.0,False,"['Piloto automático', 'Controle de estabilidad...",72832.16
DS5,Motor 2.4 Turbo,2019,NaN,True,"['Travas elétricas', '4 X 4', 'Vidros elétrico...",124549.07
Aston Martin DB4,Motor 2.4 Turbo,2006,25757.0,False,"['Rodas de liga', '4 X 4', 'Central multimídia...",92612.10

In [4]:
dataset['Valor']

Nome
Jetta Variant             88078.64
Passat                   106161.94
Crossfox                  72832.16
DS5                      124549.07
Aston Martin DB4          92612.10
                           ...
Phantom 2013              51759.58
Cadillac Ciel concept     51667.06
Classe GLK                68934.03
Aston Martin DB5         122110.90
Macan                     90381.47
Name: Valor, Length: 258, dtype: float64

In [5]:
dataset[0:3]

,Motor,Ano,Quilometragem,Zero_km,Acessórios,Valor
Nome,,,,,,
Jetta Variant,Motor 4.0 Turbo,2003,44410.0,False,"['Rodas de liga', 'Travas elétricas', 'Piloto ...",88078.64
Passat,Motor Diesel,1991,5712.0,False,"['Central multimídia', 'Teto panorâmico', 'Fre...",106161.94
Crossfox,Motor Diesel V8,1990,37123.0,False,"['Piloto automático', 'Controle de estabilidad...",72832.16

In [6]:
pd.read_csv("dados/db.csv", sep=";", usecols=["Nome", "Ano"]).head()

               Nome   Ano
0     Jetta Variant  2003
1            Passat  1991
2          Crossfox  1990
3               DS5  2019
4  Aston Martin DB4  2006

In [7]:
dataset.loc["DS5"]

Motor                                              Motor 2.4 Turbo
Ano                                                           2019
Quilometragem                                                  NaN
Zero_km                                                       True
Acessórios       ['Travas elétricas', '4 X 4', 'Vidros elétrico...
Valor                                                       124549
Name: DS5, dtype: object

In [8]:
dataset.loc[["DS5", "Passat"]]

,Motor,Ano,Quilometragem,Zero_km,Acessórios,Valor
Nome,,,,,,
DS5,Motor 2.4 Turbo,2019,NaN,True,"['Travas elétricas', '4 X 4', 'Vidros elétrico...",124549.07
Passat,Motor Diesel,1991,5712.0,False,"['Central multimídia', 'Teto panorâmico', 'Fre...",106161.94

In [9]:
dataset.loc[["DS5", "Passat"], ["Motor","Valor"]]

                  Motor      Valor
Nome
DS5     Motor 2.4 Turbo  124549.07
Passat     Motor Diesel  106161.94

In [10]:
dataset.loc[["Jetta Variant","DS5", "Passat"], ["Motor","Valor"]]

                         Motor      Valor
Nome
Jetta Variant  Motor 4.0 Turbo   88078.64
DS5            Motor 2.4 Turbo  124549.07
Passat            Motor Diesel  106161.94

In [11]:
dataset.iloc[[3,10]]

,Motor,Ano,Quilometragem,Zero_km,Acessórios,Valor
Nome,,,,,,
DS5,Motor 2.4 Turbo,2019,NaN,True,"['Travas elétricas', '4 X 4', 'Vidros elétrico...",124549.07
Ford Edge,Motor Diesel V6,2002,12859.0,False,"['Sensor crepuscular', 'Rodas de liga', 'Teto ...",71647.59

In [12]:
dataset.iloc[3:10, [2, 3,4, 5]]

,Quilometragem,Zero_km,Acessórios,Valor
Nome,,,,
DS5,NaN,True,"['Travas elétricas', '4 X 4', 'Vidros elétrico...",124549.07
Aston Martin DB4,25757.0,False,"['Rodas de liga', '4 X 4', 'Central multimídia...",92612.10
Palio Weekend,10728.0,False,"['Sensor de estacionamento', 'Teto panorâmico'...",97497.73
A5,NaN,True,"['Câmbio automático', 'Câmera de estacionament...",56445.20
Série 3 Cabrio,77599.0,False,"['Controle de estabilidade', 'Sensor crepuscul...",112310.44
Dodge Jorney,99197.0,False,"['Vidros elétricos', 'Piloto automático', 'Tet...",120716.27
Carens,37978.0,False,"['Ar condicionado', 'Painel digital', 'Central...",76566.49

In [13]:
dataset.iloc[[3,10], [2, 3,4, 5]]

,Quilometragem,Zero_km,Acessórios,Valor
Nome,,,,
DS5,NaN,True,"['Travas elétricas', '4 X 4', 'Vidros elétrico...",124549.07
Ford Edge,12859.0,False,"['Sensor crepuscular', 'Rodas de liga', 'Teto ...",71647.59

 Queries com DataFrame - Pandas

In [14]:
datasetCarros = pd.read_csv("dados/db.csv.", sep=";", index_col=0)

In [15]:
datasetCarros.head()

,Motor,Ano,Quilometragem,Zero_km,Acessórios,Valor
Nome,,,,,,
Jetta Variant,Motor 4.0 Turbo,2003,44410.0,False,"['Rodas de liga', 'Travas elétricas', 'Piloto ...",88078.64
Passat,Motor Diesel,1991,5712.0,False,"['Central multimídia', 'Teto panorâmico', 'Fre...",106161.94
Crossfox,Motor Diesel V8,1990,37123.0,False,"['Piloto automático', 'Controle de estabilidad...",72832.16
DS5,Motor 2.4 Turbo,2019,NaN,True,"['Travas elétricas', '4 X 4', 'Vidros elétrico...",124549.07
Aston Martin DB4,Motor 2.4 Turbo,2006,25757.0,False,"['Rodas de liga', '4 X 4', 'Central multimídia...",92612.10

In [16]:
datasetCarros.Motor

Nome
Jetta Variant                  Motor 4.0 Turbo
Passat                            Motor Diesel
Crossfox                       Motor Diesel V8
DS5                            Motor 2.4 Turbo
Aston Martin DB4               Motor 2.4 Turbo
                                 ...
Phantom 2013                          Motor V8
Cadillac Ciel concept                 Motor V8
Classe GLK               Motor 5.0 V8 Bi-Turbo
Aston Martin DB5                  Motor Diesel
Macan                          Motor Diesel V6
Name: Motor, Length: 258, dtype: object

In [17]:
selectMotorTurbo = datasetCarros == "Motor 2.4 Turbo"

In [18]:
type(selectMotorTurbo)

pandas.core.frame.DataFrame

In [19]:
datasetCarros[selectMotorTurbo]

,Motor,Ano,Quilometragem,Zero_km,Acessórios,Valor
Nome,,,,,,
Jetta Variant,NaN,NaN,NaN,NaN,NaN,NaN
Passat,NaN,NaN,NaN,NaN,NaN,NaN
Crossfox,NaN,NaN,NaN,NaN,NaN,NaN
DS5,Motor 2.4 Turbo,NaN,NaN,NaN,NaN,NaN
Aston Martin DB4,Motor 2.4 Turbo,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...
Phantom 2013,NaN,NaN,NaN,NaN,NaN,NaN
Cadillac Ciel concept,NaN,NaN,NaN,NaN,NaN,NaN
Classe GLK,NaN,NaN,NaN,NaN,NaN,NaN
Aston Martin DB5,NaN,NaN,NaN,NaN,NaN,NaN
Macan,NaN,NaN,NaN,NaN,NaN,NaN